<!DOCTYPE HTML>
<html lang="ru">
  <head>
    <meta charset="UTF-8" />
    <title>Корчемкина Мария</title>
    <link href="css/style.css" rel="stylesheet" />
    <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700&display=swap" rel="stylesheet">
  </head>
  <body>
    <div class="background cont">
      <header>
        <a href="#" class="menu about_me_button">Обо мне</a>
        <a href="#" class="menu hobby_button">Мое хобби</a>
        <a href="#" class="menu video_button">Любимые фильмы</a>
      </header>
      <article>
        <div class="main">
          <div class="sidebar">
            <img class="image" alt="Мое фото" src="images/my_photo.jpg" />
            <div class="lists">
              <h3 class="title_list">Любимые писатели:</h3>
              <ul>
                <li>Кристофер Паолини</li>
                <li>Стефани Майер</li>
                <li>Дэниел Киз</li>
                <li>Шарлотта Бронте</li>
              </ul>
              <h3 class="indent_list title_list">
                Любимые фильмы:
              </h3>
              <ol>
                <li>Гостья</li>
                <li>Магистр дьявольского культа</li>
                <li>Атлантида</li>
                <li>Чужестранка</li>
              </ol>
            </div>
          </div>
          <div class="main_content">
            <div class="quote_and_author">
              <p class="quote">
                Живи, пока живется
              </p>
              <p class="author">
                --- Мои девиз
              </p>
            </div>
            <h1 class="name">Корчемкина Мария</h1>
            <img class="line" alt="линия" src="images/line.jpg"/>
            <p class="vitae"> 
              Я родилась в поселке Новый Торъял в семье учителей. 
              Закончила среднюю Новоторъяльскую школу. 
              С детства занимаюсь музыкой и рисованием.
              В 2014 году закончила школу искусств по специальности "Фортепиано", 
              а в 2019 по специальности "Изобразительное искусство".  
            </p>
            <h2 class="marya_harya">Marya Harya</h2>
            <p class="hobby">
              В интернете среди моих читателей и подписчиков я больше известа под ником Маря Харя. 
              Рисование - мое главное увлечение. 
            </p>
            <p class="indent_link">
              <a class="link" href=https://vk.com/id81896685>Напиши мне </a>→
            </p>
          </div>
        </div>
        <div class="about_films">
          <h2 class="favorite_films">Любимые фильмы</h2>
          <div class="carousel">
            <div class="film_block">
              <button class="arrow prev"></button>
              <ul class="list_films">
                <li class="film">
                  <img class="photo_film" src="images/host.jpg" alt="Host"/>
                  <h4>Гостья</h4>
                  <p class="content">
                    Земля – в опасности! Наше место скоро займут Души – лишенные плотской оболочки пришельцы, 
                    вытесняющие из человеческих тел разум и замещающие его разумом собственным. 
                    Большая часть человечества уже погибла. Немногие выжившие скрываются в жалкой попытке отсрочить неизбежное… 
                    Теперь Душа пытается захватить тело юной Мелани. Однако происходит неожиданное: 
                    Мелани и ее Душа вынуждены сосуществовать в одном теле.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/Magistr.jpg" alt="Магистр дьявольского культа"/>
                  <h4>Mo dao zu shi</h4>
                  <p class="content">
                    Будучи основателем дьявольского культа, У Сянь Вэй странствовал по свету, 
                    сея хаос и наполняя страхом сердца людей. Но в итоге собственный собрат-заклинатель предал его, 
                    отдав на расправу нескольким сильнейшим кланам, объединившимся, чтобы одолеть его. 
                    Проходит несколько десятков лет после тех страшных событий, и один отчаявшийся заклинатель, 
                    отвергнутый кланом, призывает У Сянь Вэя из мира мёртвых, дабы тот воплотился в его теле 
                    и выполнил его последнее желание. Воплощение сработало, а вот остальное...
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/atlantean.jpg" alt="Атлантида"/>
                  <h4>Атлантида</h4>
                  <p class="content">
                    Атлантида... Мечтой найти легендарный затонувший в пучинах океана остров грезили многие смельчаки. 
                    Но только юному картографу Майло Тэтчу повезло: в 1914 году в его руки попал таинственный дневник, 
                    указывающий путь к Затерянной империи. И вот уже самая могучая подводная лодка в мире под 
                    командованием неустрашимого капитана Рурка выходит в открытый океан.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/outlander.jpg" alt="Чужестранка"/>
                  <h4 class="h4">Чужестранка</h4>
                  <p class="content">
                    Попадая в XVIII век, Клэр оказывается в неизвестном мире, где ее жизни угрожает опасность. 
                    Девушка должна найти возможность выжить и вернуться обратно в будущее, где остался ее муж Фрэнк Рэндалл. 
                    Чтобы спастись в неизвестном и незнакомом героине прошлом, она вынуждена выйти замуж за Джейми Фрейзера, 
                    галантного шотландского воина со сложной судьбой и обезоруживающим чувством юмора.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/hana.jpg" alt="Ха На"/>
                  <h4 class="h4">Примерная дочь Ха На</h4>
                  <p class="content">
                    Семейный бизнес семьи Чан по производству соевого соуса н асчитывает уже больше ста лет. 
                    Дела идут просто отлично, всё было бы хорошо, да только представлять интересы семьи может только мужчина. 
                    А в семье старшего сына одни только девочки. После рождения четвертой дочери все попытки обзавестись 
                    наследником терпят крах, поэтому пришло в голову родителей «гениальное» решение: если нет мальчика, 
                    то что мешает сделать его из девочки? Вот и решили они переодеть мальчиком последнюю дочь и воспитывать ее 
                    как достойного представителя семейного бизнеса и наследника империи соевых соусов.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/spirit.jpg" alt="Спирит"/>
                  <h4 class="h4">Спирит: душа прерий</h4>
                  <p class="content">
                    История дикого жеребца мустанга, Спирита, путешествующего по территории всей Америки. 
                    Храбрый Спирит заводит дружбу с молодым индейцем Ручейком и находит любовь с красивой кобылой по имени Гроза. 
                    Все счастливы до тех пор, пока на жеребца не положили глаз люди, которые хотят сделать из него военную лошадь...
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/josef.jpg" alt="Царь сновидений"/>
                  <h4 class="h4">Царь сновидений</h4>
                  <p class="content">
                    Главным героем мультика становится молодой человек по имени Иосиф. 
                    С самого детства его судьба складывалась так, будто бы он должен был стать самым счастливым человеком на свете. 
                    Отец невероятно любил своего сына, ведь тот был наделен многими талантами и действительно ясным и большим умом. 
                    Но отец не обращал внимания на остальных сыновей, отдавая все внимание одному Иосифу. 
                    Естественно, такое положение вещей не устраивало братьев Иосифа, поэтому братья продали главного героя… 
                    в рабство! Поэтому теперь Иосиф оказывается в Египте, где ему предстоит служить вместе с представителем охраны фараона.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/dirk.jpg" alt="Дирк Джентли"/>
                  <h4 class="h4">Агенство Дирка Джентли</h4>
                  <p class="content">
                    Сериал, рассказывающий о приключениях частного детектива Джентли и его невольного помощника Тодда. 
                    Каждый сезон они расследуют некую большую, казалось бы, совершенно безумную тайну и сталкиваются 
                    со странными и временами опасными персонажами. В каждой серии они приближаются к разгадке на несколько шагов, 
                    хотя их расследование страдает от недостатка логики.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/harry.jpg" alt="Гари Поттер"/>
                  <h4 class="h4">Гарри Поттер</h4>
                  <p class="content">
                    Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, едва ему исполнился год, 
                    а от дяди и тёти, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. 
                    Но в одиннадцатый день рождения Гарри всё меняется. Странный гость, неожиданно появившийся на пороге, 
                    приносит письмо, из которого мальчик узнаёт, что на самом деле он — волшебник и зачислен в школу магии 
                    под названием Хогвартс. А уже через пару недель Гарри будет мчаться в поезде Хогвартс-экспресс навстречу новой жизни, 
                    где его ждут невероятные приключения, верные друзья и самое главное — ключ к разгадке тайны смерти его родителей.
                  </p>
                </li>
                <li class="film">
                  <img class="photo_film" src="images/skipbeat.jpg" alt="Не сдавайся"/>
                  <h4 class="h4">Не сдавайся</h4>
                  <p class="content">
                    Кёко Могами с детства любила сказку про Золушку. 
                    Поэтому она твердо знает, что в начале сказке героине надо много работать – тогда в конце ее ждет 
                    свадьба с принцем. Принц уже есть – это бывший одноклассник Кёко, красавец Сё Фува, который 
                    отправился в Токио, чтобы стать поп-звездой. Кёко поехала в столицу с ним вместе. Пока Сё пробивает 
                    себе дорогу в шоу-бизнес, она готовит, стирает и работает на двух работах. Кёко не ропщет, ведь Золушка 
                    так и должна себя вести. Но тут она внезапно узнает, что ее прекрасный принц ценит Кёко только как служанку – 
                    безотказную, хоть и довольно нудную горничную...
                  </p>
                </li>
              </ul>
              <button class="arrow next"></button>
            </div>
          </div>
          <button class="all_films_button">Все фильмы</button>
        </div>
        <div class="blank">
          <h2 class="write_me">НАПИШИ МНЕ</h2>
          <form action="index.php" id="form" method="POST" class="your_form">
            <label class="label_design">Ваше имя<span class="snowflake"> *</span></label>
            <input class="cell isValidate" type="text" id="name" name="name" required /> <br />
            <label class="label_design">Ваш email<span class="snowflake"> *</span></label>
            <input class="cell isValidate" id="email" type="text" name="email" value="" required /> <br />
            <label class="label_design">Откуда вы?</label>
            <select class="combo_box" id="country" name="country"> 
              <option>Россия</option>
              <option>США</option>
              <option>Великобритания</option>
              <option>Германия</option>
              <option>Франция</option>
              <option>Италия</option>
              <option>Испания</option>
              <option>Украина</option>
              <option>Беларусь</option>
              <option>Казахстан</option>
              <option>КНР</option>
              <option>Япония</option>
              <option>Республика Корея</option>
              <option>Автралия</option>
              <option>Бразилия</option>
            </select><br/>
            <label class="label_design">Ваш пол</label><br />
              <div class="gender_choice">
                <input id="male" class="radio_button" type="radio" name="gender" checked />
                <label for="male" class="gender">Мужской</label>
                <input id="female" class="radio_button" type="radio" name="gender" />
                <label for="female" class="gender">Женский</label><br />
              </div>
            <label class="label_design">Ваше сообщение<span class="snowflake"> *</span></label>
            <textarea  id="message" class="message" name="message"></textarea> <br />
            <input type="submit" class="send" value="Отправить" />
            <p class="success" id="success">Ваше сообщение успешно отправлено</p>	
          </form>
        </div>
        <script src="js/carousel.js"></script>
        <script src="js/ajax.js" defer></script>
      </article>
      <footer>
        <p class="footer"> © 2006-2018 Поволжский государственный технологический университет, ФГБОУ ВО <q>ПГТУ</q></p>
      </footer>
    </div>
  </body>
</html>
